Revit 2027 API
SolidGlass.SolidglassBumpEnable Property
 The property labeled "Type" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SolidglassBumpEnable { get; }
Public Shared ReadOnly Property SolidglassBumpEnable As String
	Get
public:
static property String^ SolidglassBumpEnable {
	String^ get ();
}
static member SolidglassBumpEnable : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SolidglassBumpEnableType".
See Also
Reference
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace